Examinator/src/Catalogs/ВидыМероприятийСУО/ВидыМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыМероприятийСУО</name>
  <predefined>
    <items>
      <name>НаОсновеЭлектронногоРесурса</name>
      <description>Электронное обучение</description>
    </items>
  </predefined>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершаетУчащийся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПрогрессЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйБаллЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФайловДляЗавершенияУчастником</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУчащимсяПрикреплятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗапланированного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветАктивного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗавершенного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветОтмененного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестированияПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтветыВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОценкуВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытьДоступКМатериаламПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданияПроверяютсяВыборочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПодробныеСведенияОЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИзученияЭлектронныхКурсов</name>
    <type>
      <types>EnumRef.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТекущуюОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодчиненное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбязательныеСвойстваУчастников</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ВидыМероприятийСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ВидыОбучения = ТаблицаВидовОбученияДляВыбора();
		ДанныеВыбора = Новый СписокЗначений;

		Для каждого СтрокаТВО Из ВидыОбучения Цикл
		
			ДанныеВыбора.Добавить(СтрокаТВО.Ссылка,
			                      СтрокаТВО.Наименование);

		
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТаблицаВидовОбученияДляВыбора() Экспорт
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	РасширенныйИнтерфейс = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	
	// Формируем команды создания	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОбучения.Ссылка,
		|	ВидыОбучения.Наименование КАК Наименование,
		|	ВидыОбучения.Общее
		|ИЗ
		|	Справочник.ВидыМероприятийСУО КАК ВидыОбучения
		|ГДЕ
		|	ВидыОбучения.ПометкаУдаления = ЛОЖЬ
		|	И &ОтборСкрытых
		|	И &ОтборОбщих
		|	И &ОтборПоСсылке
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Если ЭтоПолныйИнтерфейс Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСсылке", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборСкрытых", "ВидыОбучения.Скрыть = ЛОЖЬ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСсылке", "ВидыОбучения.Ссылка = &ВидЭлектронногоОбучения");
		Запрос.Параметры.Вставить("ВидЭлектронногоОбучения", Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборСкрытых", "ИСТИНА");
	КонецЕсли;
	
	Если РасширенныйИнтерфейс Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборОбщих", "ИСТИНА");		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборОбщих", "ВидыОбучения.Общее = ЛОЖЬ");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция ВидыОбученияДляСозданияПроведенияОбучения()	Экспорт
	
	ТаблицаВидовОбучения = ТаблицаВидовОбученияДляВыбора();

	МассивВидовОбучения = ТаблицаВидовОбучения.ВыгрузитьКолонку("Ссылка");			

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КаталогМероприятийСУО.Ссылка КАК Мероприятие,
		|	КаталогМероприятийСУО.Вид КАК ВидОбучения
		|ИЗ
		|	Справочник.КаталогМероприятийСУО КАК КаталогМероприятийСУО
		|ГДЕ
		|	КаталогМероприятийСУО.ПометкаУдаления = ЛОЖЬ
		|	И КаталогМероприятийСУО.ЭтоГруппа = ЛОЖЬ
		|	И КаталогМероприятийСУО.Вид В(&ВидыОбучения)
		|	И КаталогМероприятийСУО.Владелец.Предопределенный = ИСТИНА";
	
	Запрос.УстановитьПараметр("ВидыОбучения", МассивВидовОбучения);
	
	ТаблицаНаличияМероприятийУВида = Запрос.Выполнить().Выгрузить();	
	
	ВидыОбучения = Новый ТаблицаЗначений;
	ВидыОбучения.Колонки.Добавить("Ссылка");
	ВидыОбучения.Колонки.Добавить("Наименование");
	ВидыОбучения.Колонки.Добавить("ЕстьМероприятие");
	ВидыОбучения.Колонки.Добавить("НельзяСоздатьБезМероприятия");
	ВидыОбучения.Колонки.Добавить("ЕдинственноеМероприятие");
	
	Для каждого ВидОбученияСтрока Из ТаблицаВидовОбучения Цикл
	
		ЕстьМероприятие = ?(ТаблицаНаличияМероприятийУВида.Найти(ВидОбученияСтрока.Ссылка, "ВидОбучения") = Неопределено, Ложь, Истина);
		
		Если ВидОбученияСтрока.Общее
			И НЕ ЕстьМероприятие Тогда
			
			Продолжить; // Общие без сценария не создаются
			
		КонецЕсли;
		
		НоваяСтрока = ВидыОбучения.Добавить();
		НоваяСтрока.Ссылка = ВидОбученияСтрока.Ссылка;
		НоваяСтрока.Наименование = ВидОбученияСтрока.Наименование;
		НоваяСтрока.ЕстьМероприятие = ЕстьМероприятие;
		
		// Общие без мероприятия пока нельзя создать.
		НоваяСтрока.НельзяСоздатьБезМероприятия = ВидОбученияСтрока.Общее; 
		НоваяСтрока.ЕдинственноеМероприятие = Неопределено;		
		
		Если НоваяСтрока.НельзяСоздатьБезМероприятия Тогда
			
			НайденныеСтроки = ТаблицаНаличияМероприятийУВида.НайтиСтроки(Новый Структура("ВидОбучения", ВидОбученияСтрока.Ссылка));
			
			Если НайденныеСтроки.Количество() = 1 Тогда
				НоваяСтрока.ЕдинственноеМероприятие = НайденныеСтроки[0].Мероприятие;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ВидыОбучения;
	
КонецФункции

Процедура ОбновитьДанныеВебКабинета(ВидОбучения, ДополнительныеДанные = Неопределено) Экспорт	
	
	// Нет данных
	
КонецПроцедуры

Функция ЗаданияПроверяютсяВыборочно(ВидОбучения) Экспорт
	Если ВидОбучения.ЗаданияПроверяютсяВыборочно ИЛИ НЕ ВидОбучения.ТребуетсяПреподаватель Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
